Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Editing Qute templates is now better than ever, with new brackets autoclose, improved HTML integration, new completion icons. In particular, the enhanced snippet completion, that behaves like IntelliJ's live templates, available for different Qute sections:
ja_jp: 新しい括弧の自動クローズ、HTMLとの統合の改善、新しい補完アイコンなど、Quteテンプレートの編集がこれまで以上に改善されました。特に、強化されたスニペット補完は、IntelliJのライブテンプレートのように動作し、異なるQuteセクションで利用できます：

source: Effective AI requires two distinct pipelines:
ja_jp: 効果的なAIには、2つの異なるパイプラインが必要です。

source: Efficiency is essential, especially in the Cloud and in containerized environments. Resources, such as CPU and memory, are shared among multiple applications. Greedy applications that consume lots of memory are inefficient and put penalties on sibling applications. You may need to request more memory, CPU, or bigger virtual machines. It either increases your monthly Cloud bill or decreases your deployment density.
ja_jp: 特にクラウドやコンテナ化された環境では、効率化が不可欠です。CPUやメモリなどのリソースは、複数のアプリケーションで共有されます。メモリを大量に消費する貪欲なアプリケーションは非効率的であり、兄弟アプリケーションにペナルティを与えます。より多くのメモリ、CPU、またはより大きな仮想マシンを要求する必要があるかもしれません。これは、毎月のクラウド料金を増加させるか、デプロイ密度を低下させるかします。

source: Efficiently scaling and optimizing the performance of your AI solutions are crucial for enterprise adoption and operational success. While this blueprint only gives you some high level guidance, we strongly recommend to also look into the non functional aspects of your solution and ways to address these concepts:
ja_jp: AIソリューションのスケーリングとパフォーマンスの最適化を効率的に行うことは、企業での採用と運用上の成功にとって不可欠です。この設計図は高レベルのガイダンスを提供するに過ぎませんが、ソリューションの非機能要件と、これらの概念に対処する方法も検討することを強く推奨します:

source: Either extend `org.hibernate.EmptyInterceptor` or implement `org.hibernate.Interceptor` directly.
ja_jp: `org.hibernate.EmptyInterceptor` を拡張するか、 `org.hibernate.Interceptor` を直接実装する。

source: Either of these commands will compile and create a native executable image. It also generates a zip file `target/function.zip`. This zip file contains your native executable image renamed to `bootstrap`. This is a requirement of the AWS Lambda Custom (Provided) Runtime.
ja_jp: これらのコマンドのいずれかがコンパイルされ、ネイティブの実行イメージが作成されます。また、zip ファイル `target/function.zip` も生成されます。このzipファイルには、 `bootstrap` にリネームされたネイティブ実行イメージが含まれています。これはAWS Lambda Custom (Provided) Runtimeの要件です。

source: Either of these commands will compile and create a native executable. It also generates a zip file `target/function.zip`. This zip file contains your native executable image renamed to `bootstrap`. This is a requirement of the AWS Lambda Custom (Provided) Runtime.
ja_jp: これらのコマンドのいずれかがコンパイルされ、ネイティブの実行可能ファイルが作成されます。また、zip ファイル `target/function.zip` も生成されます。このzipファイルには、 `bootstrap` にリネームされたネイティブ実行イメージが含まれています。これはAWS Lambda Custom (Provided) Runtimeの要件です。

source: Either use the `raw` or `safe` properties implemented as extension methods of the `java.lang.Object`,
ja_jp: `java.lang.Object` の拡張メソッドとして実装されている `raw` または `safe` プロパティーを使用します。

source: Either use the raw Vert.x instance of the Mutiny one.
ja_jp: 生のVert.xインスタンスを使用するか、Munityのを利用してください

source: Either way, when starting Quarkus dev-mode your Web UI will be served seamlessly (by default on http://0.0.0.0:8080). Both are viable options and allow you to live-code on both backend and frontend at the same time with close to no setup! Pretty awesome right?
ja_jp: どちらの方法でも、Quarkusのdevモードを起動すると、Web UIがシームレスに提供されます（デフォルトでは http://0.0.0.0:8080 ）。どちらも実行可能なオプションで、バックエンドとフロントエンドの両方を同時にライブコーディングすることができます。かなり素晴らしいでしょう？

source: Either xref:micrometer.adoc[Micrometer] or xref:microprofile-metrics.adoc[SmallRye Metrics] are capable of exposing metrics that Hibernate ORM collects at runtime. To enable exposure of Hibernate metrics on the `/q/metrics` endpoint, make sure your project depends on a metrics extension and set the configuration property `quarkus.hibernate-orm.metrics.enabled` to `true`. When using link:microprofile-metrics[SmallRye Metrics], metrics will be available under the `vendor` scope.
ja_jp: xref:micrometer.adoc[Micrometer] または xref:microprofile-metrics.adoc[SmallRye Metrics] は、Hibernate ORMが実行時に収集するメトリクスを公開することができます。 `/q/metrics` エンドポイントで Hibernate メトリクスを公開するには、プロジェクトがメトリクスエクステンションに依存していることを確認し、設定プロパティ `quarkus.hibernate-orm.metrics.enabled` を `true` に設定します。 link:microprofile-metrics[SmallRye Metrics] を使用する場合はメトリクスは `vendor` スコープで利用可能になります。

source: Either xref:telemetry-micrometer.adoc[Micrometer] or xref:microprofile-metrics.adoc[SmallRye Metrics] are capable of exposing metrics that Hibernate ORM collects at runtime. To enable exposure of Hibernate metrics on the `/q/metrics` endpoint, make sure your project depends on a metrics extension and set the configuration property `quarkus.hibernate-orm.metrics.enabled` to `true`. When using link:microprofile-metrics[SmallRye Metrics], metrics will be available under the `vendor` scope.
ja_jp: xref:telemetry-micrometer.adoc[Micrometer] または xref:microprofile-metrics.adoc[SmallRye Metrics] のいずれかを使用すると、Hibernate ORM が実行時に収集するメトリクスを公開できます。 `/q/metrics` エンドポイントで Hibernate メトリクスの公開を有効にするには、プロジェクトがメトリクスのエクステンションに依存していることを確認し、設定プロパティ `quarkus.hibernate-orm.metrics.enabled` を `true` に設定します。 link:microprofile-metrics[SmallRye Metrics] を使用する場合、 `vendor` スコープでメトリクスが利用可能になります。

source: Either xref:telemetry-micrometer.adoc[Micrometer] or xref:smallrye-metrics.adoc[SmallRye Metrics] are capable of exposing metrics that Hibernate ORM collects at runtime. To enable exposure of Hibernate metrics on the `/q/metrics` endpoint, make sure your project depends on a metrics extension and set the configuration property `quarkus.hibernate-orm.metrics.enabled` to `true`. When using xref:smallrye-metrics.adoc[SmallRye Metrics], metrics will be available under the `vendor` scope.
ja_jp: xref:telemetry-micrometer.adoc[Micrometer] または xref:smallrye-metrics.adoc[SmallRye Metrics] は、 Hibernate ORM が実行時に収集するメトリクスを公開できます。Hibernate のメトリクスを `/q/metrics` エンドポイントで公開するには、 プロジェクトがメトリクスエクステンションに依存しており、設定プロパティー `quarkus.hibernate-orm.metrics.enabled` を `true` に設定していることを確認します。 xref:smallrye-metrics.adoc[SmallRye Metrics] を使用している場合、メトリクスは `vendor` スコープ内で利用可能になります。

source: Elastic - they adapt themselves to the fluctuating load
ja_jp: 伸縮性 (Elastic) - 変動する負荷に適応すること

source: Elasticsearch Clients
ja_jp: Elasticsearch クライアント

source: Elasticsearch Java Client extension
ja_jp: Elasticsearch Java Client エクステンション

source: Elasticsearch indexing consideration
ja_jp: Elasticsearch インデックスの検討

source: Elasticsearch installed or Docker installed
ja_jp: Elasticsearchがインストールされているか、Dockerがインストールされていること

source: Elasticsearch is a well known full text search engine and NoSQL datastore.
ja_jp: Elasticsearchはよく知られた全文検索エンジンであり、NoSQLデータストアです。

source: Elasticsearch/OpenSearch do not support transactions, so multi-document updates may fail partially and leave the index in an inconsistent state.
ja_jp: Elasticsearch/OpenSearch はトランザクションをサポートしていません。 そのため、複数のドキュメントの更新が部分的に失敗し、インデックスが不整合な状態になる可能性があります。

source: Element
ja_jp: 要素

source: Eligibility for re-use
ja_jp: 再利用の適格性

source: Elvis Operator
ja_jp: エルビス演算子

source: Elvis Operator: `?:`
ja_jp: エルビス演算子: `?:`

source: Email used to subscribe to our mailing list.
ja_jp: メーリングリストに登録するために使用される電子メール。

source: Embed AI in customer-facing workflows (chatbots, fraud detection, document assistants).
ja_jp: 顧客向けのワークフロー（チャットボット、不正検出、ドキュメントアシスタント）にAIを組み込む。

source: Embedded Coordinators
ja_jp: 埋め込みコーディネーター

source: Embedded Realm Configuration
ja_jp: 組込レルムの設定

source: Embedded Roles
ja_jp: 組込ロール

source: Embedded Users
ja_jp: 組込ユーザー

source: Embedded databases (H2 and Derby) work in JVM mode. For native mode, the following limitations apply:
ja_jp: 組み込みデータベース(H2およびDerby)はJVMモードで動作します。 ネイティブモードでは、以下の制限が適用されます：

source: Embedded databases such as H2 work in JVM mode.
ja_jp: H2 などの組み込みデータベースは JVM モードで動作します。

source: Embedding H2 within your native image is not recommended. Consider using an alternative approach, for example, using a remote connection to a separate database instead.
ja_jp: ネイティブイメージにH2を埋め込むことは推奨されません。 例えば、別のデータベースへのリモート接続を使用するなど、別の方法を検討してください。

source: Embedding external content
ja_jp: 外部コンテンツの埋め込み

source: Embraces 12 factor architecture in environments like Kubernetes
ja_jp: Kubernetes のような環境で The Twelve-Factor App の方法論やアーキテクチャを採用しています

source: Embraces modern tools like LangChain4j while preserving strong typing, backward compatibility, and developer familiarity.
ja_jp: LangChain4jのような最新ツールを取り入れつつ、強力な型付け、後方互換性、開発者の親しみやすさを維持します。

source: Emit the result in the same context.
ja_jp: 同じコンテキストで結果を出力します。

source: Emits a failure when it receives the event.
ja_jp: イベントを受信したときに失敗を出力します。

source: Emits the completion event when it receives the event.
ja_jp: イベントを受信すると完了イベントを発行します。

source: Emitters and `@Channel` annotation
ja_jp: Emitter と `@Channel` アノテーション

source: Empty build items
ja_jp: 空のビルドアイテム

source: Empty build items are final (usually empty) classes which extend `io.quarkus.builder.item.EmptyBuildItem`. They represent build items that don't actually carry any data, and allow such items to be produced and consumed without having to instantiate empty classes. They cannot themselves be instantiated.
ja_jp: 空のビルドアイテムは、 `io.quarkus.builder.item.EmptyBuildItem` を拡張するfinalの（通常は空の）クラスです。空のビルドアイテムは、実際には何のデータも持たないビルドアイテムを表しており、空のクラスをインスタンス化することなく、そのようなアイテムを生成したり消費したりすることができます。空のクラスは、それ自体をインスタンス化することはできません。

source: Empty build items can represent "barriers" which can impose ordering between steps. They can also be used in the same way that popular build systems use "pseudo-targets", which is to say that the build item can represent a conceptual goal that does not have a concrete representation.
ja_jp: 空のビルドアイテムは、ステップ間の順序付けを可能にする「バリア」を表すことができます。また、一般的なビルドシステムが「疑似ターゲット」を使用するのと同じように、空のビルドアイテムを使用することもできます。

source: Enable AOT cache generation with:
ja_jp: AOT キャッシュの生成を有効にするには、以下のようにします。

source: Enable Basic Authentication
ja_jp: Basic 認証の有効化

source: Enable Basic Authentication by setting the value of `quarkus.http.auth.basic` property to `true`.
ja_jp: ベーシック認証を有効にするには `quarkus.http.auth.basic` プロパティの値を `true` に設定します。

source: Enable Basic authentication
ja_jp: ベーシック認証の有効化

source: Enable Basic authentication by setting the value of `quarkus.http.auth.basic` property to `true`.
ja_jp: `quarkus.http.auth.basic` プロパティの値を `true` に設定し、Basic 認証を有効にします。

source: Enable Basic authentication for your Quarkus project and allow users to authenticate with a username and password.
ja_jp: Quarkusプロジェクトのベーシック認証を有効にし、ユーザーがユーザー名とパスワードで認証できるようにします。

source: Enable Gzip support.
ja_jp: Gzipサポートを有効にします。

source: Enable HTTP Basic authentication
ja_jp: Basic 認証の有効化

source: Enable Hibernate Search Standalone specific management endpoints.
ja_jp: Hibernate Search Standalone 固有の管理エンドポイントを有効にします。

source: Enable Hibernate Search specific management endpoints.
ja_jp: Hibernate Search 固有の管理エンドポイントを有効にします。

source: Enable JSON metrics
ja_jp: JSON メトリクスの有効化

source: Enable Logs
ja_jp: ログの有効化

source: Enable Metrics
ja_jp: メトリクスの有効化

source: Enable Monitoring for user-defined projects in OpenShift
ja_jp: OpenShiftでユーザー定義のプロジェクトのモニタリングの有効化

source: Enable NMT on the command line;
ja_jp: コマンドラインでNMTを有効に設定;

source: Enable Quarkus HTTP upgrade sub-protocol mapping to the opening WebSocket handshake request headers.
ja_jp: 開いている WebSocket ハンドシェイクリクエストヘッダーへの Quarkus HTTP アップグレードサブプロトコルマッピングを有効にします。

source: Enable SMTP Access to your Office 365 mailbox, you can do it from the administration console (see link:https://learn.microsoft.com/en-us/exchange/clients-and-mobile-in-exchange-online/authenticated-client-smtp-submission[this guide] for more information)
ja_jp: Office 365 メールボックスへの SMTP アクセスを有効にします。これは、管理コンソールから実行できます (詳細は、link:https://learn.microsoft.com/en-us/exchange/clients-and-mobile-in-exchange-online/authenticated-client-smtp-submission[このガイド] を参照してください)

source: Enable XA support explicitly for each relevant datasource by setting <<quarkus-agroal_quarkus-datasource-jdbc-transactions,`quarkus.datasource[.optional name].jdbc.transactions`>> to `xa`.
ja_jp: 関連するデータソースごとに XA サポートを明示的に有効にするには、 <<quarkus-agroal_quarkus-datasource-jdbc-transactions,`quarkus.datasource[.optional name].jdbc.transactions`>> を `xa` に設定します。

source: Enable YAML configuration
ja_jp: YAML設定の有効化

source: Enable `DEBUG` level is for the logger `io.quarkus.websockets.next.traffic`.
ja_jp: ロガー `io.quarkus.websockets.next.traffic` に対して `DEBUG` レベルを有効にします。

source: Enable `List<Hero>` data to be added to queries that respond with `Film`
ja_jp: `Film` で応答するクエリに `List<Hero>` データを追加できるようになりました。

source: Enable `Sign in with Apple` and press `Configure`:
ja_jp: `Sign in with Apple` を有効にして、 `Configure` を押します。

source: Enable `io.quarkus.oidc.client.runtime.OidcClientImpl` `TRACE` level logging to see more details about the token acquisition and refresh errors:
ja_jp: トークン取得および更新エラーの詳細を確認するには、 `io.quarkus.oidc.client.runtime.OidcClientImpl` `TRACE` レベルのロギングを有効にしてください。

source: Enable `io.quarkus.oidc.client.runtime.OidcClientRecorder` `TRACE` level logging to see more details about the OidcClient initialization errors:
ja_jp: OidcClient の初期化エラーの詳細を確認するには、 `io.quarkus.oidc.client.runtime.OidcClientRecorder` `TRACE` レベルのログを有効にしてください。

source: Enable all origins exclusively for the dev profile. It is not advisable to permit all origins in a production environment, as it can lead to significant security risks.
ja_jp: devプロファイルに対してのみ、すべてのoriginを有効にします。 本番環境ですべてのオリジンを許可することは、重大なセキュリティリスクにつながる可能性があるため、お勧めできません。

source: Enable and configure CORS in Quarkus to specify allowed origins, methods, and headers, guiding browsers in handling cross-origin requests safely.
ja_jp: QuarkusでCORSを有効にして設定し、許可されるオリジン、メソッド、ヘッダーを指定することで、ブラウザがクロスオリジンリクエストを安全に処理できるようになります。

source: Enable and require the mutual TLS client authentication and use the `tls-config-1` TLS configuration for the HTTP server TLS communication. The `tls-config-1` TLS configuration is registered in the TLS registry.
ja_jp: 相互 TLS クライアント認証を有効にして必須にし、HTTP サーバー TLS 通信には `tls-config-1` TLS 設定を使用します。`tls-config-1` TLS 設定は TLS レジストリーに登録されています。

source: Enable and require the mutual TLS client authentication.
ja_jp: 相互 TLS クライアント認証を有効にして、必須にします。

source: Enable batching of messages.
ja_jp: メッセージのバッチ処理を有効にします。

source: Enable chunking of messages.
ja_jp: メッセージのチャンキングを有効にします。

source: Enable container-based native builds:
ja_jp: コンテナーベースのネイティブビルドを有効にする:

source: Enable database multi-tenancy.
ja_jp: データベースのマルチテナンシーを有効にします。

source: Enable debug logging for all logging categories.
ja_jp: すべてのロギングカテゴリのデバッグロギングを有効にします。

source: Enable default token introspection and userinfo cache
ja_jp: デフォルトのトークンイントロスペクションと UserInfo キャッシュを有効にする

source: Enable discovery
ja_jp: ディスカバリーを有効にする

source: Enable discriminator multi-tenancy.
ja_jp: discriminator マルチテナンシーを有効にします。

source: Enable effective POM-based project layout discovery
ja_jp: 効果的なPOMベースのプロジェクト・レイアウト・ディスカバリーを有効化

source: Enable inclusive authentication in the lax mode
ja_jp: lax モードでの統合認証の有効化

source: Enable it as follows:
ja_jp: 次のように有効にします。

source: Enable metrics
ja_jp: メトリクスの有効化

source: Enable metrics collection
ja_jp: メトリクスの収集の有効化

source: Enable optimistic locking
ja_jp: 楽観的ロックの有効化

source: Enable predictive AI, model training, and scalable data workflows, connecting seamlessly to ML tools, message brokers, databases, and files.
ja_jp: 予測AI、モデルトレーニング、スケーラブルなデータワークフローを可能にし、MLツール、メッセージブローカー、データベース、ファイルにシームレスに接続します。

source: Enable proper logging for `@QuarkusTest` by setting the `java.util.logging.manager` system property to `org.jboss.logmanager.LogManager`.
ja_jp: `java.util.logging.manager` システム・プロパティを `org.jboss.logmanager.LogManager` に設定して、 `@QuarkusTest` の適切なロギングを有効にします。

source: Enable reading of secrets. Note the use of `%prod` profile as we only want this setting applied when the application is running in production.
ja_jp: Secretsの読み取りを有効にします。アプリケーションが本番稼動しているときにのみこの設定を適用するため、 `%prod` プロファイルを使用していることに注意してください。

source: Enable resource metadata properties
ja_jp: リソースメタデータプロパティーを有効にする

source: Enable schema multi-tenancy.
ja_jp: スキーマのマルチテナンシーを有効にします。

source: Enable section numbering
ja_jp: セクション番号付けを有効にします。

source: Enable section numbering before specifying the header for the first step.
ja_jp: 最初の手順のヘッダーを指定する前に、セクションの番号付けを有効にします。

source: Enable the Basic Authentication for your Quarkus project and allow users to authenticate with a username and password.
ja_jp: QuarkusプロジェクトのBasic 認証を有効にして、ユーザーがユーザー名とパスワードで認証できるようにします。

source: Enable the Basic authentication and use the `QuarkusTestRealm` authentication realm.
ja_jp: Basic 認証を有効にし、`QuarkusTestRealm` 認証レルムを使用します。

source: Enable the Basic authentication.
ja_jp: Basic 認証を有効にします。

source: Enable the End User Attributes feature so that the `SecurityIdentity` principal and roles are added as Span attributes. The End User attributes are personally identifiable information, therefore make sure you want to export them before you enable this feature.
ja_jp: End User 属性機能を有効にして、 `SecurityIdentity` プリンシパルとロールが Span 属性として追加されるようにします。 End User 属性は個人を特定できる情報であるため、この機能を有効にする前にエクスポートすることを確認してください。

source: Enable the HTTP Basic authentication for your Quarkus project and allow users to authenticate with a username and password.
ja_jp: QuarkusプロジェクトのBasic 認証を有効にして、ユーザーがユーザー名とパスワードで認証できるようにします。

source: Enable the OpenTelemetry logging. Must be set at build time.
ja_jp: OpenTelemetry Loggingを有効にします。ビルド時に設定する必要があります。

source: Enable the OpenTelemetry metrics. Must be set at build time.
ja_jp: OpenTelemetry メトリクスを有効にします。 ビルド時に設定する必要があります。

source: Enable the Quarkus GitHub provider
ja_jp: Quarkus GitHub プロバイダーを有効にします。

source: Enable the `Post` group, meaning only constraints assigned to the `Post` (and `Default`) groups will be validated for the `book` parameter of the `post` method. In this case, it means `Book.id` must be `null` and `Book.title` must not be blank.
ja_jp: `Post` グループを有効にすると、 `Post` (および `Default`) グループに割り当てられた制約のみが `post` メソッドの `book` パラメータに対して検証されることを意味します。この場合、 `Book.id` は `null` でなければならず、 `Book.title` は空白であってはならないことを意味します。

source: Enable the `Put` group, meaning only constraints assigned to the `Put` (and `Default`) groups will be validated for the `book` parameter of the `put` method. In this case, it means `Book.id` must not be `null` and `Book.title` must not be blank.
ja_jp: `Put` グループを有効にすると、 `Put` (および `Default`) グループに割り当てられた制約のみが `put` メソッドの `book` パラメータに対して検証されることを意味します。この場合、 `Book.id` は `null` であってはならず、 `Book.title` は空白であってはならないことを意味します。

source: Enable the `native` package type. The build will therefore produce a native executable.
ja_jp: `native` パッケージタイプを有効にします。そのため、ビルドはネイティブ実行可能ファイルを生成します。

source: Enable the appropriate <<native-transport>> and set the following environment property:
ja_jp: 適切な <<native-transport>> を有効にし、以下の環境プロパティを設定します。

source: Enable the appropriate xref:native-transport[Use native transports] and set the following environment property:
ja_jp: 適切な xref:native-transport[ネイティブ・トランスポートの使用] を有効にし、以下の環境プロパティを設定してください：

source: Enable the built-in Quarkus xref:security-basic-authentication.adoc[Basic authentication] mechanism by setting the `quarkus.http.auth.basic` property to `true`:
ja_jp: `quarkus.http.auth.basic` プロパティーを `true` に設定して、組み込みの Quarkus xref:security-basic-authentication.adoc[Basic 認証] メカニズムを有効にします。

source: Enable the health checks
ja_jp: ヘルスチェックの有効化

source: Enable the xref:./management-interface-reference.adoc[management interface].
ja_jp: xref:./management-interface-reference.adoc[管理インターフェイス] を有効にします。

source: Enable this strategy with:
ja_jp: この戦略を有効にするのは以下の通りです:

source: Enable xref:security-basic-authentication.adoc[Basic authentication] for your Quarkus project and allow users to authenticate with a username and password.
ja_jp: Quarkus プロジェクトで xref:security-basic-authentication.adoc[Basic 認証] を有効にし、ユーザーがユーザー名とパスワードで認証できるようにします。

source: Enable xref:security-built-in-authentication.adoc#basic-auth[Quarkus built-in basic HTTP authentication] by setting the `quarkus.http.auth.basic` property to `true`:
ja_jp: `quarkus.http.auth.basic` プロパティを `true` に設定することで、 link:security-built-in-authentication.html#basic-auth[Quarkus に組み込まれたベーシック HTTP 認証] を有効にします:

source: Enable/Disable channels
ja_jp: チャネルを有効化/無効化

source: Enabled with `mp.messaging.outgoing.$channel.propagate-record-key=true` configuration, record key propagation produces the outgoing record with the same _key_ as the incoming record.
ja_jp: `mp.messaging.outgoing.$channel.propagate-record-key=true` の設定で有効にすると、 レコードキーの伝播が受信レコードと同じ _キー_ を持つ送信レコードを生成します。

source: Enablement
ja_jp: 有効化

source: Enables 'security' category tracing.
ja_jp: 「セキュリティ」カテゴリのトレースを有効にします。

source: Enables (default) or disables the Cloud Event support. If enabled on an _incoming_ channel, the connector analyzes the incoming records and try to create Cloud Event metadata. If enabled on an _outgoing_, the connector sends the outgoing messages as Cloud Event if the message includes Cloud Event Metadata. Type: _boolean_
ja_jp: クラウド イベント サポートを有効（デフォルト）または無効にします。 _incoming_ チャネルで有効にすると、コネクタは受信レコードを分析し、Cloud Event メタデータの作成を試みます。 _outgoing_ 側で有効にすると、メッセージに Cloud Event Metadata が含まれている場合、コネクタはoutgoingメッセージを Cloud Event として送信します。 Type: _boolean_

source: Enables bloom filter for the 'books' cache
ja_jp: 'books' キャッシュのブルームフィルタを有効にします

source: Enables near caching for the 'books' cache by setting the mode to `INVALIDATED`
ja_jp: モードを `INVALIDATED` に設定して 'books' キャッシュのニアキャッシュを有効にします

source: Enables the CORS filter.
ja_jp: CORS フィルターを有効にします。

source: Enables the Keycloak policy enforcer to manage access control based on defined permissions.
ja_jp: Keycloak ポリシーエンフォーサーが、定義された権限に基づいてアクセス制御を管理できるようにします。

source: Enables the `all-open` annotation plugin (see discussion below)
ja_jp: `all-open` アノテーションプラグインの有効化（以下の議論を参照）

source: Enables the alternative. The priority could be any number to override the default bean but if there are multiple alternatives the highest priority wins.
ja_jp: 代替 Beanを有効にします。優先度はデフォルトの Bean を上書きするために任意の数値を指定できますが、複数の代替 Bean がある場合は、最も高い優先度のものが優先されます。

source: Enables the in-container build
ja_jp: コンテナー内ビルドを有効にします。

source: Enables the native-image bundle generation
ja_jp: ネイティブイメージバンドルの生成を有効化

source: Enables tracing.
ja_jp: トレースを有効化します。

source: Enables traffic logging.
ja_jp: トラフィックロギングを有効にします。

source: Enabling / Disabling Dev Services for AMQP
ja_jp: Dev Services for AMQPの有効化／無効化

source: Enabling / Disabling Dev Services for Apicurio Registry
ja_jp: Dev Services for Apicurio Registryの有効化／無効化

source: Enabling / Disabling Dev Services for Database
ja_jp: Dev Services for Database の有効化/無効化

source: Enabling / Disabling Dev Services for Elasticsearch
ja_jp: Dev Services for Elasticsearchの有効化／無効化

source: Enabling / Disabling Dev Services for Infinispan
ja_jp: Infinispanの開発サービスの有効化／無効化

source: Enabling / Disabling Dev Services for Kafka
ja_jp: Dev Services for Kafkaの有効化／無効化

source: Enabling / Disabling Dev Services for Kogito
ja_jp: Dev Services for Kogitoの有効化／無効化

source: Enabling / Disabling Dev Services for Kubernetes
ja_jp: Dev Services for Kubernetesの有効化／無効化

source: Enabling / Disabling Dev Services for LRA
ja_jp: LRA 用 Dev Services の有効化/無効化

source: Enabling / Disabling Dev Services for Pulsar
ja_jp: Dev Services for Pulsar の有効化/無効化

source: Enabling / Disabling Dev Services for RabbitMQ
ja_jp: Dev Services for RabbitMQの有効化/無効化

source: Enabling / Disabling SnapStart Optimizations
ja_jp: SnapStart最適化の有効化/無効化

source: Enabling / disabling Dev Services for RabbitMQ
ja_jp: Dev Services for RabbitMQ の有効化/無効化

source: Enabling Beans for Quarkus Build Profile
ja_jp: Quarkus ビルドプロファイルの Bean の有効化

source: Enabling Beans for Quarkus Build Properties
ja_jp: Quarkus ビルドプロパティーの Bean を有効にする

source: Enabling Cassandra Metrics
ja_jp: Cassandra メトリクスの有効化

source: Enabling DPoP support in Quarkus requires a single property.
ja_jp: QuarkusでDPoPサポートを有効にするには、1つのプロパティが必要です。
